app/views/topics/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."topic_id" = 1
---
<ul id="projects">
  <% @topic.projects.each do |project| %>