app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def create
    @topic = Topic.new(params[:topic])
  if @topic.save
---
INSERT INTO "topics" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Jul 2013 22:59:42 UTC +00:00], ["description", "A tiny cat"], ["name", "Molly"], ["updated_at", Wed, 24 Jul 2013 22:59:42 UTC +00:00]]

  def update
    if @topic.update_attributes(params[:topic])
---
UPDATE "topics" SET "name" = 'Patrick', "description" = '', "updated_at" = '2013-07-25 00:15:16.662109' WHERE "topics"."id" = 1

def destroy
  @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]

  def find_topic
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]